MikroElektronika/core_packages/ARM/gcc_clang/def/sam/ATSAM4LS4BA/mcu.h
// Peripheral instances on HTOP2 bridge
#define ID_PM            64 /**< \brief Power Manager (PM) */
#define ID_CHIPID        65 /**< \brief Chip ID Registers (CHIPID) */
#define ID_SCIF          66 /**< \brief System Control Interface (SCIF) */
#define ID_FREQM         67 /**< \brief Frequency Meter (FREQM) */
#define ID_GPIO          68 /**< \brief General-Purpose Input/Output Controller (GPIO) */

// Peripheral instances on HTOP3 bridge
#define ID_BPM           96 /**< \brief Backup Power Manager (BPM) */
#define ID_BSCIF         97 /**< \brief Backup System Control Interface (BSCIF) */
#define ID_AST           98 /**< \brief Asynchronous Timer (AST) */
#define ID_WDT           99 /**< \brief Watchdog Timer (WDT) */
#define ID_EIC          100 /**< \brief External Interrupt Controller (EIC) */
#define ID_PICOUART     101 /**< \brief Pico UART (PICOUART) */

#define ID_PERIPH_COUNT 102 /**< \brief Max number of peripheral IDs */
/*@}*/

/* ************************************************************************** */
/**  BASE ADDRESS DEFINITIONS FOR SAM4LS4B */
/* ************************************************************************** */
/** \defgroup SAM4LS4B_base Peripheral Base Address Definitions */
/*@{*/

#if defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)
#define ABDACB                        (0x40064000) /**< \brief (ABDACB) APB Base Address */
#define ACIFC                         (0x40040000) /**< \brief (ACIFC) APB Base Address */
#define ADCIFE                        (0x40038000) /**< \brief (ADCIFE) APB Base Address */
#define AST                           (0x400F0800) /**< \brief (AST) APB Base Address */
#define BPM                           (0x400F0000) /**< \brief (BPM) APB Base Address */
#define BSCIF                         (0x400F0400) /**< \brief (BSCIF) APB Base Address */
#define CATB                          (0x40070000) /**< \brief (CATB) APB Base Address */
#define CHIPID                        (0x400E0400) /**< \brief (CHIPID) APB Base Address */
#define CRCCU                         (0x400A4000) /**< \brief (CRCCU) APB Base Address */
#define DACC                          (0x4003C000) /**< \brief (DACC) APB Base Address */
#define EIC                           (0x400F1000) /**< \brief (EIC) APB Base Address */
#define HFLASHC                       (0x400A0000) /**< \brief (HFLASHC) APB Base Address */
#define HFLASHC_FROW                  (0x00800200) /**< \brief (HFLASHC) FROW Base Address */
#define HFLASHC_USER                  (0x00800000) /**< \brief (HFLASHC) USER Base Address */
#define FREQM                         (0x400E0C00) /**< \brief (FREQM) APB Base Address */
#define GLOC                          (0x40060000) /**< \brief (GLOC) APB Base Address */
#define GPIO                          (0x400E1000) /**< \brief (GPIO) APB Base Address */
#define HCACHE                        (0x400A0400) /**< \brief (HCACHE) APB Base Address */
#define HMATRIX                       (0x400A1000) /**< \brief (HMATRIX) APB Base Address */
#define IISC                          (0x40004000) /**< \brief (IISC) APB Base Address */
#define PARC                          (0x4006C000) /**< \brief (PARC) APB Base Address */
#define PDCA                          (0x400A2000) /**< \brief (PDCA) APB Base Address */
#define PEVC                          (0x400A6000) /**< \brief (PEVC) APB Base Address */
#define PICOUART                      (0x400F1400) /**< \brief (PICOUART) APB Base Address */
#define PM                            (0x400E0000) /**< \brief (PM) APB Base Address */
#define SCIF                          (0x400E0800) /**< \brief (SCIF) APB Base Address */
#define SMAP                          (0x400A3000) /**< \brief (SMAP) APB Base Address */
#define SPI                           (0x40008000) /**< \brief (SPI) APB Base Address */
#define TC0                           (0x40010000) /**< \brief (TC0) APB Base Address */
#define TC1                           (0x40014000) /**< \brief (TC1) APB Base Address */
#define TRNG                          (0x40068000) /**< \brief (TRNG) APB Base Address */
#define TWIM0                         (0x40018000) /**< \brief (TWIM0) APB Base Address */
#define TWIM1                         (0x4001C000) /**< \brief (TWIM1) APB Base Address */
#define TWIM2                         (0x40078000) /**< \brief (TWIM2) APB Base Address */
#define TWIM3                         (0x4007C000) /**< \brief (TWIM3) APB Base Address */
#define TWIS0                         (0x40018400) /**< \brief (TWIS0) APB Base Address */
#define TWIS1                         (0x4001C400) /**< \brief (TWIS1) APB Base Address */
#define USART0                        (0x40024000) /**< \brief (USART0) APB Base Address */
#define USART1                        (0x40028000) /**< \brief (USART1) APB Base Address */
#define USART2                        (0x4002C000) /**< \brief (USART2) APB Base Address */
#define USART3                        (0x40030000) /**< \brief (USART3) APB Base Address */
#define USBC                          (0x400A5000) /**< \brief (USBC) APB Base Address */
#define WDT                           (0x400F0C00) /**< \brief (WDT) APB Base Address */
#else
#define ABDACB            ((Abdacb   *)0x40064000UL) /**< \brief (ABDACB) APB Base Address */
#define ABDACB_ADDR                   (0x40064000UL) /**< \brief (ABDACB) APB Base Address */
#define ABDACB_INST_NUM   1                          /**< \brief (ABDACB) Number of instances */
#define ABDACB_INSTS      { ABDACB }                 /**< \brief (ABDACB) Instances List */

#define ACIFC             ((Acifc    *)0x40040000UL) /**< \brief (ACIFC) APB Base Address */
#define ACIFC_ADDR                    (0x40040000UL) /**< \brief (ACIFC) APB Base Address */
#define ACIFC_INST_NUM    1                          /**< \brief (ACIFC) Number of instances */
#define ACIFC_INSTS       { ACIFC }                  /**< \brief (ACIFC) Instances List */

#define ADCIFE            ((Adcife   *)0x40038000UL) /**< \brief (ADCIFE) APB Base Address */
#define ADCIFE_ADDR                   (0x40038000UL) /**< \brief (ADCIFE) APB Base Address */
#define ADCIFE_INST_NUM   1                          /**< \brief (ADCIFE) Number of instances */
#define ADCIFE_INSTS      { ADCIFE }                 /**< \brief (ADCIFE) Instances List */

#define AST               ((Ast      *)0x400F0800UL) /**< \brief (AST) APB Base Address */
#define AST_ADDR                      (0x400F0800UL) /**< \brief (AST) APB Base Address */
#define AST_INST_NUM      1                          /**< \brief (AST) Number of instances */
#define AST_INSTS         { AST }                    /**< \brief (AST) Instances List */

